bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_pds.h
/**
  ******************************************************************************
  * @file    bl702l_pds.h
  * @version V1.0
  * @date
  * @brief   This file is the standard driver header file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __BL702L_PDS_H__
#define __BL702L_PDS_H__

#include "pds_reg.h"
#include "bl702l_aon.h"
#include "bl702l_hbn.h"
#include "bl702l_common.h"
#include "bflb_sflash.h"

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup  BL702L_Peripheral_Driver
 *  @{
 */

/** @addtogroup  PDS
 *  @{
 */

/** @defgroup  PDS_Public_Types
 *  @{
 */

/**
 *  @brief PDS GPIO configuration type definition
 */
typedef struct
{
    uint8_t pd_en;
    uint8_t pu_en;
    uint8_t ie_en;
    uint8_t oe_en;
} PDS_GPIO_Cfg_Type;

/**
 *  @brief PDS RAM configuration type definition
 */
typedef struct
{
    uint32_t PDS_RAM_CFG_0KB_16KB_CPU_RAM_RET1N  : 1;  /*!< [0] 0~16KB cpu_ram RET1N */
    uint32_t PDS_RAM_CFG_16KB_32KB_CPU_RAM_RET1N : 1;  /*!< [1] 16~32KB cpu_ram RET1N */
    uint32_t PDS_RAM_CFG_32KB_48KB_CPU_RAM_RET1N : 1;  /*!< [2] 32~48KB cpu_ram RET1N */
    uint32_t PDS_RAM_CFG_48KB_64KB_CPU_RAM_RET1N : 1;  /*!< [3] 48~64KB cpu_ram RET1N */
    uint32_t PDS_RAM_CFG_64KB_80KB_CPU_RAM_RET1N : 1;  /*!< [4] 64~80KB cpu_ram RET1N */
    uint32_t PDS_RAM_CFG_RSV_5_7                 : 3;  /*!< [7:5]reserve */
    uint32_t PDS_RAM_CFG_0KB_16KB_CPU_RAM_RET2N  : 1;  /*!< [8] 0~16KB cpu_ram RET2N */
    uint32_t PDS_RAM_CFG_16KB_32KB_CPU_RAM_RET2N : 1;  /*!< [9] 16~32KB cpu_ram RET2N */
    uint32_t PDS_RAM_CFG_32KB_48KB_CPU_RAM_RET2N : 1;  /*!< [10] 32~48KB cpu_ram RET2N */
    uint32_t PDS_RAM_CFG_48KB_64KB_CPU_RAM_RET2N : 1;  /*!< [11] 48~64KB cpu_ram RET2N */
    uint32_t PDS_RAM_CFG_64KB_80KB_CPU_RAM_RET2N : 1;  /*!< [12] 64~80KB cpu_ram RET2N */
    uint32_t PDS_RAM_CFG_RSV_13_15               : 3;  /*!< [15:13]reserve */
    uint32_t PDS_RAM_CFG_0KB_16KB_CPU_RAM_PGEN   : 1;  /*!< [16] 0~16KB cpu_ram PGEN */
    uint32_t PDS_RAM_CFG_16KB_32KB_CPU_RAM_PGEN  : 1;  /*!< [17] 16~32KB cpu_ram PGEN */
    uint32_t PDS_RAM_CFG_32KB_48KB_CPU_RAM_PGEN  : 1;  /*!< [18] 32~48KB cpu_ram PGEN */
    uint32_t PDS_RAM_CFG_48KB_64KB_CPU_RAM_PGEN  : 1;  /*!< [19] 48~64KB cpu_ram PGEN */
    uint32_t PDS_RAM_CFG_64KB_80KB_CPU_RAM_PGEN  : 1;  /*!< [20] 64~80KB cpu_ram PGEN */
    uint32_t PDS_RAM_CFG_RSV_21_31               : 11; /*!< [31:21]reserve */
} PDS_RAM_CFG_Type;

/**
 *  @brief PDS configuration type definition
 */
typedef struct
{
    uint32_t pdsStart       : 1; /*!< [0]PDS Start */
    uint32_t sleepForever   : 1; /*!< [1]PDS sleep forever */
    uint32_t xtalForceOff   : 1; /*!< [2]Power off xtal force */
    uint32_t waitRC32mRdy   : 1; /*!< [3]wait XTAL Ready during before PDS Interrupt */
    uint32_t avdd14Off      : 1; /*!< [4]power down avdd14 during PDS */
    uint32_t bgSysOff       : 1; /*!< [5]power down bg_sys during PDS */
    uint32_t glbRstProtect  : 1; /*!< [6]avoid glb_reg reset by any reset */
    uint32_t puFlash        : 1; /*!< [7]turn off Flash Power During PDS */
    uint32_t clkOff         : 1; /*!< [8]gate clock during PDS (each pwr domain has its own control) */
    uint32_t memStby        : 1; /*!< [9]mem_stby during PDS (each power domain can has its own control) */
    uint32_t swPuFlash      : 1; /*!< [10]SW Turn on Flash */
    uint32_t isolation      : 1; /*!< [11]Isolation during PDS (each power domain can has its own control) */
    uint32_t waitXtalRdy    : 1; /*!< [12]wait XTAL Ready during before PDS Interrupt */
    uint32_t pdsPwrOff      : 1; /*!< [13]Power off during PDS (each power domain can has its own control) */
    uint32_t xtalOff        : 1; /*!< [14]xtal power down during PDS */
    uint32_t socEnbForceOn  : 1; /*!< [15]pds_soc_enb always active */
    uint32_t pdsRstSocEn    : 1; /*!< [16]pds_rst controlled by PDS */
    uint32_t pdsRC32mOn     : 1; /*!< [17]RC32M always on or RC32M on/off controlled by PDS state */
    uint32_t pdsLdoVselEn   : 1; /*!< [18]PDS "SLEEP" control LDO voltage enable */
    uint32_t rsv19          : 1; /*!< [19]Reserved */
    uint32_t xtalCntRC32kEn : 1; /*!< [20]HW Auto count RC32K to be XTAL Counter after PDS */
    uint32_t cpu0WfiMask    : 1; /*!< [21]pds start condition mask np_wfi */
    uint32_t ldo11Off       : 1; /*!< [22]power down ldo11 during PDS */
    uint32_t pdsCtlRfSel    : 1; /*!< [23]PDS control RF on/off */
    uint32_t xtalDegEn      : 1; /*!< [24]Enable Digital Deg */
    uint32_t bleWakeupReqEn : 1; /*!< [25]PDS auto send ble_wakeup_req to sleep_timer when exit PDS */
    uint32_t swGpioIsoMod   : 1; /*!< [26]SW force keep GPIO */
    uint32_t pdsClkOff      : 1; /*!< [27]Turn off PDS Clock , Set this bit to 0 to active PDS */
    uint32_t pdsGpioKeep    : 3; /*!< [30:28]enable or disable keep function */
    uint32_t pdsGpioIsoMod  : 1; /*!< [31]HW Keep GPIO at PDS Mode  */
} PDS_CTL_Type;

/**
 *  @brief PDS force configuration type definition
 */
typedef struct
{
    uint32_t rsv0_7          : 8;  /*!< [7:0]reserve */
    uint32_t forceCpuPdsRst  : 1;  /*!< [8]manual force NP pds reset */
    uint32_t rsv9            : 1;  /*!< [9]reserve */
    uint32_t forceBzPdsRst   : 1;  /*!< [10]manual force BZ pds reset */
    uint32_t rsv11_15        : 5;  /*!< [15:11]reserve */
    uint32_t forceCpuGateClk : 1;  /*!< [16]manual force NP clock gated */
    uint32_t rsv17           : 1;  /*!< [17]reserve */
    uint32_t forceBzGateClk  : 1;  /*!< [18]manual force BZ clock gated */
    uint32_t rsv19_31        : 13; /*!< [31:19]reserve */
} PDS_CTL2_Type;

/**
 *  @brief PDS force configuration type definition
 */
typedef struct
{
    uint32_t rsv0             : 1;  /*!< [0]reserve */
    uint32_t forceMiscPwrOff  : 1;  /*!< [1]manual force MISC pwr_off */
    uint32_t rsv2_6           : 5;  /*!< [6:2]reserve */
    uint32_t forceMiscPdsRst  : 1;  /*!< [7]manual force MISC pds_rst */
    uint32_t rsv8_12          : 5;  /*!< [12:8]reserve */
    uint32_t forceMiscGateClk : 1;  /*!< [13]manual force MISC gate_clk */
    uint32_t rsv14_29         : 16; /*!< [29:14]reserve */
    uint32_t MiscIsoEn        : 1;  /*!< [30]make misc isolated at PDS Sleep state */
    uint32_t rsv31            : 1;  /*!< [31]reserve */
} PDS_CTL3_Type;

/**
 *  @brief PDS force configuration type definition
 */
typedef struct
{
    uint32_t rsv0        : 1; /*!< [0]reserve */
    uint32_t cpuRst      : 1; /*!< [1]NP reset at PDS Sleep state */
    uint32_t rsv2        : 1; /*!< [2]reserve */
    uint32_t cpuGateClk  : 1; /*!< [3]NP clock gated at PDS Sleep state */
    uint32_t rsv4_12     : 9; /*!< [12:4]reserve */
    uint32_t BzRst       : 1; /*!< [13]BZ reset at PDS Sleep state */
    uint32_t rsv14       : 1; /*!< [14]reserve */
    uint32_t BzGateClk   : 1; /*!< [15]BZ clock gated at PDS Sleep state */
    uint32_t rsv16_23    : 8; /*!< [23:16]reserve */
    uint32_t MiscPwrOff  : 1; /*!< [24]core_misc Power off at PDS Sleep state */
    uint32_t MiscRst     : 1; /*!< [25]core_misc reset at PDS Sleep state */
    uint32_t rsv26       : 1; /*!< [26]reserve */
    uint32_t MiscGateClk : 1; /*!< [27]core_misc clock gated at PDS Sleep state */
    uint32_t rsv28_31    : 4; /*!< [30:28]reserve */
} PDS_CTL4_Type;

/**
 *  @brief PDS default level configuration type definition
 */
typedef struct
{
    PDS_CTL_Type pdsCtl;   /*!< PDS_CTL configuration */
    PDS_CTL2_Type pdsCtl2; /*!< PDS_CTL2 configuration */
    PDS_CTL3_Type pdsCtl3; /*!< PDS_CTL3 configuration */
    PDS_CTL4_Type pdsCtl4; /*!< PDS_CTL4 configuration */
} PDS_DEFAULT_LV_CFG_Type;

/**
 *  @brief PDS interrupt type definition
 */
enum {
    PDS_INT_WAKEUP = 0,  /*!< PDS wakeup interrupt(assert bit while wakeup, include PDS_Timer/...) */
    PDS_INT_RF_DONE = 2, /*!< PDS RF done interrupt */
    PDS_INT_MAX,         /*!< PDS int max number */
};
typedef BL_ENUM_Type PDS_INT_Type;

enum {
    PDS_WAKEUP_SRC_HBN_IRQ_OUT = 0, /*!< wakeup trigger by hbn_irq_out[1:0] */
    PDS_WAKEUP_SRC_KYD_WAKEUP,      /*!< wakeup trigger by pds_kyd_wakeup */
    PDS_WAKEUP_SRC_GPIO_IRQ,        /*!< wakeup trigger by gpio_irq */
    PDS_WAKEUP_SRC_PDS_IO_INT,      /*!< wakeup trigger by irrx_int */
    PDS_WAKEUP_SRC_BLE_SLP_IRQ,     /*!< wakeup trigger by ble_slp_irq */
    PDS_WAKEUP_SRC_KYS_INT,         /*!< wakeup trigger by kys_int */
    PDS_WAKEUP_SRC_WDG_TIMEOUT,     /*!< wakeup trigger by pds_watchdog_timeout event */
};
typedef BL_ENUM_Type PDS_WAKEUP_SRC_Type;

/**
 *  @brief PDS GPIO type definition
 */
enum {
    PDS_GPIO_PIN_0 = 0,
    PDS_GPIO_PIN_1,
    PDS_GPIO_PIN_2,
    PDS_GPIO_PIN_3,
    PDS_GPIO_PIN_7 = 7,
    PDS_GPIO_PIN_8,
    PDS_GPIO_PIN_14 = 14,
    PDS_GPIO_PIN_15,
    PDS_GPIO_PIN_16,
    PDS_GPIO_PIN_17,
    PDS_GPIO_PIN_18,
    PDS_GPIO_PIN_19,
    PDS_GPIO_PIN_20,
    PDS_GPIO_PIN_21,
    PDS_GPIO_PIN_22,
    PDS_GPIO_PIN_23,
    PDS_GPIO_PIN_24,
    PDS_GPIO_PIN_25,
    PDS_GPIO_PIN_26,
    PDS_GPIO_PIN_27,
    PDS_GPIO_PIN_28,
    PDS_GPIO_PIN_29,
    PDS_GPIO_PIN_MAX,
};
typedef BL_ENUM_Type PDS_GPIO_Type;

enum {
    PDS_KEY_ROW_0 = 0,
    PDS_KEY_ROW_1,
    PDS_KEY_ROW_2,
    PDS_KEY_ROW_3,
    PDS_KEY_ROW_4,
    PDS_KEY_ROW_5,
    PDS_KEY_ROW_6,
    PDS_KEY_ROW_7,
};
typedef BL_ENUM_Type PDS_KEY_ROW_Type;

enum {
    PDS_KEY_COL_0 = 0,
    PDS_KEY_COL_1,
    PDS_KEY_COL_2,
    PDS_KEY_COL_3,
    PDS_KEY_COL_4,
    PDS_KEY_COL_5,
    PDS_KEY_COL_6,
    PDS_KEY_COL_7,
};
