bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_pds.h
typedef BL_ENUM_Type PDS_KEY_COL_Type;

/**
 * @brief PDS KYS COL and ROW GPIO Select
 */
enum {
    PDS_KYS_GPIO_PIN_0 = 0,
    PDS_KYS_GPIO_PIN_1,
    PDS_KYS_GPIO_PIN_2,
    PDS_KYS_GPIO_PIN_3,
    PDS_KYS_GPIO_PIN_7 = 7,
    PDS_KYS_GPIO_PIN_8,
    PDS_KYS_GPIO_PIN_9,
    PDS_KYS_GPIO_PIN_10,
    PDS_KYS_GPIO_PIN_11,
    PDS_KYS_GPIO_PIN_12,
    PDS_KYS_GPIO_PIN_13,
    PDS_KYS_GPIO_PIN_14,
    PDS_KYS_GPIO_PIN_15,
    PDS_KYS_GPIO_PIN_16,
    PDS_KYS_GPIO_PIN_17,
    PDS_KYS_GPIO_PIN_18,
    PDS_KYS_GPIO_PIN_19,
    PDS_KYS_GPIO_PIN_20,
    PDS_KYS_GPIO_PIN_21,
    PDS_KYS_GPIO_PIN_22,
    PDS_KYS_GPIO_PIN_23,
    PDS_KYS_GPIO_PIN_24,
    PDS_KYS_GPIO_PIN_25,
    PDS_KYS_GPIO_PIN_26,
    PDS_KYS_GPIO_PIN_27,
    PDS_KYS_GPIO_PIN_28,
    PDS_KYS_GPIO_PIN_29,
    PDS_KYS_GPIO_PIN_30,
    PDS_KYS_GPIO_PIN_31,
    PDS_KYS_GPIO_PIN_MAX,
};
typedef BL_ENUM_Type PDS_KYS_GPIO_Type;

/**
 * @brief PDS KYD White Key Select
 */
enum {
    PDS_KYD_NO_WHITE_KEY_MODE = 0,
    PDS_KYD_INVERT_DETECT_MODE,
    PDS_KYD_MASK_DETECT_MODE,
};
typedef BL_ENUM_Type PDS_KYD_WHITE_KEY_MODE_Type;

/**
 *  @brief PDS GPIO group set type
 */
enum {
    PDS_GPIO_GROUP_SET_GPIO0_GPIO3,   /*!< gpio int set 0, gpio0 - gpio3   */
    PDS_GPIO_GROUP_SET_GPIO7,         /*!< gpio int set 1, gpio7           */
    PDS_GPIO_GROUP_SET_GPIO8,         /*!< gpio int set 2, gpio8           */
    PDS_GPIO_GROUP_SET_GPIO14_GPIO15, /*!< gpio int set 3, gpio14 - gpio15 */
    PDS_GPIO_GROUP_SET_GPIO16_GPIO19, /*!< gpio int set 4, gpio16 - gpio19 */
    PDS_GPIO_GROUP_SET_GPIO20_GPIO23, /*!< gpio int set 5, gpio20 - gpio23 */
    PDS_GPIO_GROUP_SET_GPIO24_GPIO27, /*!< gpio int set 6, gpio14 - gpio17 */
    PDS_GPIO_GROUP_SET_GPIO28_GPIO29, /*!< gpio int set 7, gpio28 - gpio29 */
};
typedef BL_ENUM_Type PDS_GPIO_GROUP_SET_Type;

/**
 *  @brief PDS reset event type definition
 */
enum {
    PDS_RST_EVENT_BUS_RST,        /*!< hreset_n (Bus Reset) */
    PDS_RST_EVENT_HBN_PWR_ON_RST, /*!< pwr_rst_n (hbn power on reset) */
    PDS_RST_EVENT_PDS_RST,        /*!< pds_rst_n (pds reset) */
    PDS_RST_EVENT_MAX,            /*!< PDS rst event max number */
};
typedef BL_ENUM_Type PDS_RST_EVENT_Type;

/**
 *  @brief PDS RF status type definition
 */
enum {
    PDS_RF_STS_OFF = 0,        /*!< 4'b0000 */
    PDS_RF_STS_PU_MBG = 1,     /*!< 4'b0001 */
    PDS_RF_STS_PU_LDO15RF = 3, /*!< 4'b0011 */
    PDS_RF_STS_PU_SFREG = 7,   /*!< 4'b0111 */
    PDS_RF_STS_BZ_EN_AON = 15, /*!< 4'b1111 */
};
typedef BL_ENUM_Type PDS_RF_STS_Type;

/**
 *  @brief PDS status type definition
 */
enum {
    PDS_STS_IDLE = 0,            /*!< 4'b0000 */
    PDS_STS_ECG = 8,             /*!< 4'b1000 */
    PDS_STS_ERST = 12,           /*!< 4'b1100 */
    PDS_STS_EISO = 15,           /*!< 4'b1111 */
    PDS_STS_POFF = 7,            /*!< 4'b0111 */
    PDS_STS_PRE_BGON = 3,        /*!< 4'b0011 */
    PDS_STS_PRE_BGON1 = 1,       /*!< 4'b0001 */
    PDS_STS_BGON = 5,            /*!< 4'b0101 */
    PDS_STS_CLK_SW_32M = 4,      /*!< 4'b0100 */
    PDS_STS_PON_DCDC = 6,        /*!< 4'b0110 */
    PDS_STS_PON_LDO11_MISC = 14, /*!< 4'b1110 */
    PDS_STS_PON = 10,            /*!< 4'b1010 */
    PDS_STS_DISO = 2,            /*!< 4'b0010 */
    PDS_STS_DCG = 13,            /*!< 4'b1101 */
    PDS_STS_DRST = 11,           /*!< 4'b1011 */
    PDS_STS_WAIT_EFUSE = 9,      /*!< 4'b1001 */
};
typedef BL_ENUM_Type PDS_STS_Type;

/**
 *  @brief PDS auto power down configuration type definition
 */
typedef struct
{
    BL_Fun_Type mbgPower;      /*!< PDS auto [31] MBG power */
    BL_Fun_Type ldo18rfPower;  /*!< PDS auto [30] LDO18RF power */
    BL_Fun_Type sfregPower;    /*!< PDS auto [29] SF_REG power */
    BL_Fun_Type pllPower;      /*!< PDS auto [28] PLL power */
    BL_Fun_Type cpu0Power;     /*!< PDS auto [19] NP power */
    BL_Fun_Type rc32mPower;    /*!< PDS auto [17] RC32M power */
    BL_Fun_Type xtalPower;     /*!< PDS auto [14] XTAL power */
    BL_Fun_Type allPower;      /*!< PDS auto [13] all power */
    BL_Fun_Type isoPower;      /*!< PDS auto [11] ISO power */
    BL_Fun_Type bzPower;       /*!< PDS auto [10] BZ power */
    BL_Fun_Type sramDisStanby; /*!< PDS auto [9] SRAM memory stanby disable */
    BL_Fun_Type cgPower;       /*!< PDS auto [8] CG power */
    BL_Fun_Type cpu1Power;     /*!< PDS auto [7] AP power */
    BL_Fun_Type usbPower;      /*!< PDS auto [3] USB power */
} PDS_AUTO_POWER_DOWN_CFG_Type;

/**
 *  @brief PDS auto configuration type definition
 */
typedef struct
{
    uint32_t vddcoreVol;             /*!< PDS auto [27:24] VDDCORE voltage, reference 0x4001F80C[27:24], recommended 0xA */
    BL_Fun_Type vddcoreVolEn;        /*!< PDS auto [18] VDDCORE voltage enable bit */
    BL_Fun_Type cpu0NotNeedWFI;      /*!< PDS auto [21] NP not need WFI to get in PDS mode */
    BL_Fun_Type cpu1NotNeedWFI;      /*!< PDS auto [20] AP not need WFI to get in PDS mode */
    BL_Fun_Type busReset;            /*!< PDS auto [16] bus reset bit, reset after wake up from PDS mode */
    BL_Fun_Type disIrqWakeUp;        /*!< PDS auto [15] disable IRQ request to wake up from PDS mode, except PDS counter IRQ */
    BL_Fun_Type powerOffXtalForever; /*!< PDS auto [2] power off xtal after get in PDS mode, and never power on xtal after wake up */
    BL_Fun_Type sleepForever;        /*!< PDS auto [1] sleep forever after get in PDS mode, need reset system to restart */
} PDS_AUTO_NORMAL_CFG_Type;

/**
 *  @brief PDS force type definition
 */
enum {
    PDS_FORCE_NP,  /*!< PDS force NP */
    PDS_FORCE_RSV, /*!< rsv */
    PDS_FORCE_BZ,  /*!< PDS force BZ */
};
typedef BL_ENUM_Type PDS_FORCE_Type;

/*@} end of group PDS_Public_Types */

/** @defgroup  PDS_Public_Constants
 *  @{
 */

/** @defgroup  PDS_INT_TYPE
 *  @{
 */
#define IS_PDS_INT_TYPE(type) (((type) == PDS_INT_WAKEUP) || \
                               ((type) == PDS_INT_RF_DONE))

/** @defgroup  PDS_WAKEUP_SRC_Type
 *  @{
 */
#define IS_PDS_WAKEUP_SRC_Type (((type) == PDS_WAKEUP_SRC_HBN_IRQ_OUT) || \
                                ((type) == PDS_WAKEUP_SRC_KYD_WAKEUP) ||  \
                                ((type) == PDS_WAKEUP_SRC_GPIO_IRQ) ||    \
                                ((type) == PDS_WAKEUP_SRC_PDS_IO_INT) ||  \
                                ((type) == PDS_WAKEUP_SRC_BLE_SLP_IRQ) || \
                                ((type) == PDS_WAKEUP_SRC_KYS_INT) ||     \
                                ((type) == PDS_WAKEUP_SRC_WDG_TIMEOUT))

/** @defgroup  PDS_GPIO_Type
 *  @{
 */
#define IS_PDS_GPIO_TYPE(type) (((type) == PDS_GPIO_PIN_0) ||  \
                                ((type) == PDS_GPIO_PIN_1) ||  \
                                ((type) == PDS_GPIO_PIN_2) ||  \
                                ((type) == PDS_GPIO_PIN_3) ||  \
                                ((type) == PDS_GPIO_PIN_7) ||  \
                                ((type) == PDS_GPIO_PIN_8) ||  \
                                ((type) == PDS_GPIO_PIN_14) || \
                                ((type) == PDS_GPIO_PIN_15) || \
                                ((type) == PDS_GPIO_PIN_16) || \
                                ((type) == PDS_GPIO_PIN_17) || \
                                ((type) == PDS_GPIO_PIN_18) || \
                                ((type) == PDS_GPIO_PIN_19) || \
                                ((type) == PDS_GPIO_PIN_20) || \
                                ((type) == PDS_GPIO_PIN_21) || \
                                ((type) == PDS_GPIO_PIN_22) || \
                                ((type) == PDS_GPIO_PIN_23) || \
                                ((type) == PDS_GPIO_PIN_24) || \
                                ((type) == PDS_GPIO_PIN_25) || \
                                ((type) == PDS_GPIO_PIN_26) || \
                                ((type) == PDS_GPIO_PIN_27) || \
                                ((type) == PDS_GPIO_PIN_28) || \
                                ((type) == PDS_GPIO_PIN_29))

/** @defgroup  PDS_KYS_GPIO_Type
 *  @{
 */
#define IS_PDS_KYS_GPIO_TYPE(type) (((type) == PDS_KYS_GPIO_PIN_0) ||  \
                                    ((type) == PDS_KYS_GPIO_PIN_1) ||  \
                                    ((type) == PDS_KYS_GPIO_PIN_2) ||  \
                                    ((type) == PDS_KYS_GPIO_PIN_3) ||  \
                                    ((type) == PDS_KYS_GPIO_PIN_7) ||  \
                                    ((type) == PDS_KYS_GPIO_PIN_8) ||  \
                                    ((type) == PDS_KYS_GPIO_PIN_9) ||  \
                                    ((type) == PDS_KYS_GPIO_PIN_10) || \
                                    ((type) == PDS_KYS_GPIO_PIN_11) || \
                                    ((type) == PDS_KYS_GPIO_PIN_12) || \
                                    ((type) == PDS_KYS_GPIO_PIN_13) || \
                                    ((type) == PDS_KYS_GPIO_PIN_14) || \
                                    ((type) == PDS_KYS_GPIO_PIN_15) || \
                                    ((type) == PDS_KYS_GPIO_PIN_16) || \
                                    ((type) == PDS_KYS_GPIO_PIN_17) || \
                                    ((type) == PDS_KYS_GPIO_PIN_18) || \
                                    ((type) == PDS_KYS_GPIO_PIN_19) || \
                                    ((type) == PDS_KYS_GPIO_PIN_20) || \
                                    ((type) == PDS_KYS_GPIO_PIN_21) || \
                                    ((type) == PDS_KYS_GPIO_PIN_22) || \
                                    ((type) == PDS_KYS_GPIO_PIN_23) || \
                                    ((type) == PDS_KYS_GPIO_PIN_24) || \
                                    ((type) == PDS_KYS_GPIO_PIN_25) || \
                                    ((type) == PDS_KYS_GPIO_PIN_26) || \
                                    ((type) == PDS_KYS_GPIO_PIN_27) || \
                                    ((type) == PDS_KYS_GPIO_PIN_28) || \
                                    ((type) == PDS_KYS_GPIO_PIN_29) || \
                                    ((type) == PDS_KYS_GPIO_PIN_30) || \
                                    ((type) == PDS_KYS_GPIO_PIN_31))

#define IS_PDS_KYS_ROW_TYPE(type) (((type) == PDS_KEY_ROW_0) || \
                                   ((type) == PDS_KEY_ROW_1) || \
                                   ((type) == PDS_KEY_ROW_2) || \
                                   ((type) == PDS_KEY_ROW_3) || \
                                   ((type) == PDS_KEY_ROW_4) || \
                                   ((type) == PDS_KEY_ROW_5) || \
                                   ((type) == PDS_KEY_ROW_6) || \
                                   ((type) == PDS_KEY_ROW_7))

#define IS_PDS_KYS_COL_TYPE(type) (((type) == PDS_KEY_COL_0) || \
                                   ((type) == PDS_KEY_COL_1) || \
                                   ((type) == PDS_KEY_COL_2) || \
                                   ((type) == PDS_KEY_COL_3) || \
                                   ((type) == PDS_KEY_COL_4) || \
                                   ((type) == PDS_KEY_COL_5) || \
                                   ((type) == PDS_KEY_COL_6) || \
                                   ((type) == PDS_KEY_COL_7))

