bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_pds.h
/** @defgroup  PDS_GPIO_GROUP_SET_Type
 *  @{
 */
#define IS_PDS_GPIO_GROUP_SET_Type(type) (((type) == PDS_GPIO_GROUP_SET_GPIO0_GPIO3) ||   \
                                          ((type) == PDS_GPIO_GROUP_SET_GPIO7) ||         \
                                          ((type) == PDS_GPIO_GROUP_SET_GPIO8) ||         \
                                          ((type) == PDS_GPIO_GROUP_SET_GPIO14_GPIO15) || \
                                          ((type) == PDS_GPIO_GROUP_SET_GPIO16_GPIO19) || \
                                          ((type) == PDS_GPIO_GROUP_SET_GPIO20_GPIO23) || \
                                          ((type) == PDS_GPIO_GROUP_SET_GPIO24_GPIO27) || \
                                          ((type) == PDS_GPIO_GROUP_SET_GPIO28_GPIO29))

/**
 *  @brief PDS GPIO interrupt control mode type definition
 */
enum {
    PDS_GPIO_INT_SYNC_FALLING_EDGE = 0,        /*!< GPIO interrupt sync mode, GPIO negedge pulse trigger interrupt */
    PDS_GPIO_INT_SYNC_RISING_EDGE = 1,         /*!< GPIO interrupt sync mode, GPIO posedge pulse trigger interrupt */
    PDS_GPIO_INT_SYNC_LOW_LEVEL = 2,           /*!< GPIO interrupt sync mode, GPIO negedge level trigger interrupt */
    PDS_GPIO_INT_SYNC_HIGH_LEVEL = 3,          /*!< GPIO interrupt sync mode, GPIO posedge level trigger interrupt */
    PDS_GPIO_INT_SYNC_RISING_FALLING_EDGE = 4, /*!< GPIO interrupt sync mode, GPIO posedge negedge pulse trigger interrupt */
    PDS_GPIO_INT_ASYNC_FALLING_EDGE = 8,       /*!< GPIO interrupt async mode, GPIO negedge pulse trigger interrupt */
    PDS_GPIO_INT_ASYNC_RISING_EDGE = 9,        /*!< GPIO interrupt async mode, GPIO posedge pulse trigger interrupt */
    PDS_GPIO_INT_ASYNC_LOW_LEVEL = 10,         /*!< GPIO interrupt async mode, GPIO negedge level trigger interrupt */
    PDS_GPIO_INT_ASYNC_HIGH_LEVEL = 11,        /*!< GPIO interrupt async mode, GPIO posedge level trigger interrupt */
};
typedef BL_ENUM_Type PDS_GPIO_INT_TRIG_Type;

/** @defgroup  PDS_RST_EVENT_TYPE
 *  @{
 */
#define IS_PDS_RST_EVENT_TYPE(type) (((type) == PDS_RST_EVENT_BUS_RST) ||        \
                                     ((type) == PDS_RST_EVENT_HBN_PWR_ON_RST) || \
                                     ((type) == PDS_RST_EVENT_PDS_RST) ||        \
                                     ((type) == PDS_RST_EVENT_MAX))

/** @defgroup  PDS_PLL_STS_TYPE
 *  @{
 */
#define IS_PDS_PLL_STS_TYPE(type) (((type) == PDS_PLL_STS_OFF) ||   \
                                   ((type) == PDS_PLL_STS_SFREG) || \
                                   ((type) == PDS_PLL_STS_PU) ||    \
                                   ((type) == PDS_PLL_STS_RDY))

/** @defgroup  PDS_RF_STS_TYPE
 *  @{
 */
#define IS_PDS_RF_STS_TYPE(type) (((type) == PDS_RF_STS_OFF) ||        \
                                  ((type) == PDS_RF_STS_PU_MBG) ||     \
                                  ((type) == PDS_RF_STS_PU_LDO15RF) || \
                                  ((type) == PDS_RF_STS_PU_SFREG) ||   \
                                  ((type) == PDS_RF_STS_BZ_EN_AON))

/** @defgroup  PDS_STS_TYPE
 *  @{
 */
#define IS_PDS_STS_TYPE(type) (((type) == PDS_STS_IDLE) ||           \
                               ((type) == PDS_STS_ECG) ||            \
                               ((type) == PDS_STS_ERST) ||           \
                               ((type) == PDS_STS_EISO) ||           \
                               ((type) == PDS_STS_POFF) ||           \
                               ((type) == PDS_STS_PRE_BGON) ||       \
                               ((type) == PDS_STS_PRE_BGON1) ||      \
                               ((type) == PDS_STS_BGON) ||           \
                               ((type) == PDS_STS_CLK_SW_32M) ||     \
                               ((type) == PDS_STS_PON_DCDC) ||       \
                               ((type) == PDS_STS_PON_LDO11_MISC) || \
                               ((type) == PDS_STS_PON) ||            \
                               ((type) == PDS_STS_DISO) ||           \
                               ((type) == PDS_STS_DCG) ||            \
                               ((type) == PDS_STS_DRST) ||           \
                               ((type) == PDS_STS_WAIT_EFUSE))

/** @defgroup  PDS_PLL_XTAL_TYPE
 *  @{
 */
#define IS_PDS_PLL_XTAL_TYPE(type) (((type) == PDS_PLL_XTAL_NONE) || \
                                    ((type) == PDS_PLL_XTAL_32M) ||  \
                                    ((type) == PDS_PLL_XTAL_RC32M))

/** @defgroup  PDS_PLL_CLK_TYPE
 *  @{
 */
#define IS_PDS_PLL_CLK_TYPE(type) (((type) == PDS_PLL_CLK_480M) || \
                                   ((type) == PDS_PLL_CLK_240M) || \
                                   ((type) == PDS_PLL_CLK_192M) || \
                                   ((type) == PDS_PLL_CLK_160M) || \
                                   ((type) == PDS_PLL_CLK_120M) || \
                                   ((type) == PDS_PLL_CLK_96M) ||  \
                                   ((type) == PDS_PLL_CLK_80M) ||  \
                                   ((type) == PDS_PLL_CLK_48M) ||  \
                                   ((type) == PDS_PLL_CLK_32M))

/** @defgroup  PDS_FORCE_TYPE
 *  @{
 */
#define IS_PDS_FORCE_TYPE(type) (((type) == PDS_FORCE_NP) ||  \
                                 ((type) == PDS_FORCE_RSV) || \
                                 ((type) == PDS_FORCE_BZ) ||  \
                                 ((type) == PDS_FORCE_USB))

/** @defgroup  PDS_AUDIO_PLL_TYPE
 *  @{
 */
#define IS_PDS_AUDIO_PLL_TYPE(type) (((type) == AUDIO_PLL_12288000_HZ) || \
                                     ((type) == AUDIO_PLL_11289600_HZ) || \
                                     ((type) == AUDIO_PLL_5644800_HZ) ||  \
                                     ((type) == AUDIO_PLL_24576000_HZ) || \
                                     ((type) == AUDIO_PLL_24000000_HZ) || \
                                     ((type) == AUDIO_PLL_50000000_HZ))

/*@} end of group PDS_Public_Constants */

/** @defgroup  PDS_Public_Macros
 *  @{
 */
#define PDS_LDO_MIN_PU_CNT        (25) /* LDO need 25 cycles to power up */
#define PDS_WARMUP_CNT            (38) /* LDO hw warmup compensation latency cycles */
#define PDS_WARMUP_LATENCY_CNT    (38) /* LDO hw warmup compensation latency cycles */
#define PDS_FORCE_PWR_OFF_OFFSET  (0)
#define PDS_FORCE_ISO_EN_OFFSET   (4)
#define PDS_FORCE_PDS_RST_OFFSET  (8)
#define PDS_FORCE_MEM_STBY_OFFSET (12)
#define PDS_FORCE_GATE_CLK_OFFSET (16)

#define PDS_GPIO_IS_GROUP_ID(pin) (pin >> 2)
/*@} end of group PDS_Public_Macros */

/** @defgroup  PDS_Public_Functions
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
BL_Err_Type PDS_Int_Callback_Install(PDS_INT_Type intType, intCallback_Type *cbFun);
void PDS_WAKEUP_IRQHandler(void);
#endif
/*----------*/
BL_Err_Type PDS_Set_GPIO_Pad_Cfg(PDS_GPIO_Type pin, PDS_GPIO_Cfg_Type *cfg);
BL_Err_Type PDS_GPIO_Write(PDS_GPIO_GROUP_SET_Type grp, uint32_t val);
BL_Err_Type PDS_Set_GPIO_Pad_IntMask(PDS_GPIO_GROUP_SET_Type grp, BL_Mask_Type intMask);
BL_Err_Type PDS_Set_GPIO_Pad_IntMode(PDS_GPIO_GROUP_SET_Type grp, PDS_GPIO_INT_TRIG_Type trig);
BL_Err_Type PDS_Set_GPIO_Pad_IntClr(PDS_GPIO_GROUP_SET_Type grp);
BL_Err_Type PDS_Set_All_GPIO_IntClear(void);
BL_Sts_Type PDS_Get_GPIO_Pad_IntStatus(PDS_GPIO_Type pin);
/*----------*/
BL_Err_Type PDS_Set_Flash_Pad_Pull_None(uint8_t pinCfg);
BL_Err_Type PDS_Set_Flash_Pad_Pull_None_Fast(uint8_t pinCfg);
/*----------*/
BL_Err_Type PDS_Disable_GPIO_Keep(void);
BL_Err_Type PDS_Enable_PDS_Pad_Keep(uint32_t keepSel);
/*----------*/
BL_Err_Type PDS_Enable(PDS_CTL_Type *cfg, PDS_CTL4_Type *cfg4, uint32_t pdsSleepCnt);
BL_Err_Type PDS_Force_Config(PDS_CTL2_Type *cfg2, PDS_CTL3_Type *cfg3);
BL_Err_Type PDS_RAM_Config(PDS_RAM_CFG_Type *ramCfg);
BL_Err_Type PDS_Default_Level_Config(PDS_DEFAULT_LV_CFG_Type *defaultLvCfg, uint32_t pdsSleepCnt);
/*----------*/
BL_Err_Type PDS_Wakeup_Src_En(PDS_WAKEUP_SRC_Type intType, BL_Fun_Type enable);
BL_Sts_Type PDS_Get_Wakeup_Src(PDS_WAKEUP_SRC_Type intType);
BL_Err_Type PDS_IntMask(PDS_INT_Type intType, BL_Mask_Type intMask);
BL_Sts_Type PDS_Get_IntStatus(PDS_INT_Type intType);
BL_Err_Type PDS_IntClear(void);
/*----------*/
PDS_RF_STS_Type PDS_Get_PdsRfStstus(void);
PDS_STS_Type PDS_Get_PdsStstus(void);
/*----------*/
BL_Err_Type PDS_Clear_Reset_Event(void);
BL_Sts_Type PDS_Get_Reset_Event(PDS_RST_EVENT_Type event);
/*----------*/
BL_Err_Type PDS_WAKEUP_IRQHandler_Install(void);
BL_Err_Type PDS_Int_Callback_Install(PDS_INT_Type intType, intCallback_Type *cbFun);
/*----------*/
// void PDS_Auto_Time_Config(uint32_t sleepDuration);
void PDS_Auto_Enable(PDS_AUTO_POWER_DOWN_CFG_Type *powerCfg, PDS_AUTO_NORMAL_CFG_Type *normalCfg, BL_Fun_Type enable);
void PDS_Manual_Force_Turn_Off(PDS_FORCE_Type domain);
void PDS_Manual_Force_Turn_On(PDS_FORCE_Type domain);
/*----------*/
BL_Err_Type PDS_Set_KYD_Matrix_Size(uint8_t col_size, uint8_t row_size);
BL_Err_Type PDS_Set_KYD_Col_Value(uint8_t val);
BL_Err_Type PDS_Set_KYD_Row_Pull(uint8_t en);
BL_Err_Type PDS_Set_KYD_Wakeup_En(uint8_t en);
BL_Err_Type PDS_Clear_KYD_Wakeup(void);
BL_Err_Type PDS_Set_KYS_ROW_IN_GPIO(PDS_KEY_ROW_Type row_x, PDS_KYS_GPIO_Type sel_io);
BL_Err_Type PDS_Set_KYS_COL_OUT_GPIO(PDS_KEY_COL_Type col_x, PDS_KYS_GPIO_Type sel_io);
BL_Err_Type PDS_Get_KYS_Wakeup_ROW_INDEX_GPIO(PDS_KEY_ROW_Type* row_index,PDS_KYS_GPIO_Type* row_gpio);
BL_Err_Type PDS_Get_KYS_Wakeup_COL_INDEX_GPIO(PDS_KEY_COL_Type* col_index,PDS_KYS_GPIO_Type* col_gpio);
BL_Err_Type PDS_Set_KYS_White_Key(uint8_t white_key_i ,PDS_KEY_ROW_Type row_index,PDS_KEY_COL_Type col_index,PDS_KYD_WHITE_KEY_MODE_Type type);
/*----------*/

/*@} end of group PDS_Public_Functions */

/*@} end of group PDS */

/*@} end of group BL702L_Peripheral_Driver */

#ifdef __cplusplus
}
#endif

#endif /* __BL702L_PDS_H__ */
